nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso54114/multicore_examples/multicore_manager/cm4/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN 0x80u    /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INPFILT_OFF 0x0100u /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_0 (number 31), U18[4]/TO_MUX_P0_0-ISP_RX
  @{ */
#define BOARD_INITPINS_CORE0_DEBUG_UART_RX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_CORE0_DEBUG_UART_RX_PIN 0U  /*!<@brief 0U pin index: 0 */
                                                   /* @} */

/*! @name PIO0_1 (number 32), U6[4]/U22[3]/P0_1-ISP_TX
  @{ */
#define BOARD_INITPINS_CORE0_DEBUG_UART_TX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_CORE0_DEBUG_UART_TX_PIN 1U  /*!<@brief 0U pin index: 1 */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Core0(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
